app/Models/UserModel.php

    public function submitSignUpForm($data)
    {
        $db = Database::connect();
        $builder = $db->table('users');
        $builder->insert($data);
---
INSERT INTO `users` (`first_name`, `last_name`, `email`, `phone`, `password`, `date_created`) VALUES ('Farouq', 'Umar', 'lasaa@email.com', '08012345678', 'password', '2022-04-30 10:57:33')